import "../Main.css";
// import "../AboutMe/AboutMe.css";
export default function AboutMe() {
  return (
    <div className="aboutMe">
      <title>обо мне</title>
      <h1>Кто я такой и с чего начал</h1>
      <p>
        Я студент, ранее изучавший информационную безопасность, но страсть к
        frontend разработке изменила мои планы. Волейбол и пешие прогулки
        помогают мне сохранять баланс между учебой и отдыхом. Я часто слушаю
        IT-подкасты, чтобы быть в курсе последних тенденций в технологиях.
        Стремлюсь к чистому, эффективному и масштабируемому коду и прилагаю все
        усилия для достижения этой цели.
      </p>
    </div>
  );
}
